PX4/PX4-Autopilot/nuttx/configs/stm3240g-eval/src/up_lcd.c
static inline void stm3240g_lcdinitialize(void)
{
  uint16_t id;

  /* Check if the LCD is Orise Tech SPFD5408B Controller (or the compatible RenesasSP
   * R61580).
   */

  id = stm3240g_readreg(LCD_REG_0);
  lcddbg("LCD ID: %04x\n", id);

  /* Check if the ID is for the SPFD5408B */

#if !defined(CONFIG_STM32_SPFD5408B_DISABLE)
  if (id == SPFD5408B_ID)
    {
      /* Set the LCD type for the SPFD5408B */

      g_lcddev.type = LCD_TYPE_SPFD5408B;
      lcddbg("LCD type: %d\n", g_lcddev.type);

      /* Start Initial Sequence */

      stm3240g_writereg(LCD_REG_1,   0x0100); /* Set SS bit */
      stm3240g_writereg(LCD_REG_2,   0x0700); /* Set 1 line inversion */
      stm3240g_writereg(LCD_REG_3,   0x1030); /* Set GRAM write direction and BGR=1. */
      stm3240g_writereg(LCD_REG_4,   0x0000); /* Resize register */
      stm3240g_writereg(LCD_REG_8,   0x0202); /* Set the back porch and front porch */
      stm3240g_writereg(LCD_REG_9,   0x0000); /* Set non-display area refresh cycle ISC[3:0] */
      stm3240g_writereg(LCD_REG_10,  0x0000); /* FMARK function */
      stm3240g_writereg(LCD_REG_12,  0x0000); /* RGB 18-bit System interface setting */
      stm3240g_writereg(LCD_REG_13,  0x0000); /* Frame marker Position */
      stm3240g_writereg(LCD_REG_15,  0x0000); /* RGB interface polarity, no impact */

      /* Power On sequence */

      stm3240g_writereg(LCD_REG_16,  0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
      stm3240g_writereg(LCD_REG_18,  0x0000); /* VREG1OUT voltage */
      stm3240g_writereg(LCD_REG_19,  0x0000); /* VDV[4:0] for VCOM amplitude */
      up_mdelay(200);                         /* Dis-charge capacitor power voltage (200ms) */

      stm3240g_writereg(LCD_REG_17,  0x0007);  /* DC1[2:0], DC0[2:0], VC[2:0] */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_16,  0x12B0);  /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_18,  0x01bd);  /* External reference voltage= Vci */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_19,  0x1400);  /* VDV[4:0] for VCOM amplitude */
      stm3240g_writereg(LCD_REG_41,  0x000e);  /* VCM[4:0] for VCOMH */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_32,  0x0000); /* GRAM horizontal Address */
      stm3240g_writereg(LCD_REG_33,  0x013f); /* GRAM Vertical Address */

      /* Adjust the Gamma Curve (SPFD5408B)*/

      stm3240g_writereg(LCD_REG_48,  0x0b0d);
      stm3240g_writereg(LCD_REG_49,  0x1923);
      stm3240g_writereg(LCD_REG_50,  0x1c26);
      stm3240g_writereg(LCD_REG_51,  0x261c);
      stm3240g_writereg(LCD_REG_52,  0x2419);
      stm3240g_writereg(LCD_REG_53,  0x0d0b);
      stm3240g_writereg(LCD_REG_54,  0x1006);
      stm3240g_writereg(LCD_REG_55,  0x0610);
      stm3240g_writereg(LCD_REG_56,  0x0706);
      stm3240g_writereg(LCD_REG_57,  0x0304);
      stm3240g_writereg(LCD_REG_58,  0x0e05);
      stm3240g_writereg(LCD_REG_59,  0x0e01);
      stm3240g_writereg(LCD_REG_60,  0x010e);
      stm3240g_writereg(LCD_REG_61,  0x050e);
      stm3240g_writereg(LCD_REG_62,  0x0403);
      stm3240g_writereg(LCD_REG_63,  0x0607);

      /* Set GRAM area */

      stm3240g_writereg(LCD_REG_80,  0x0000); /* Horizontal GRAM Start Address */
      stm3240g_writereg(LCD_REG_81,  0x00ef); /* Horizontal GRAM End Address */
      stm3240g_writereg(LCD_REG_82,  0x0000); /* Vertical GRAM Start Address */
      stm3240g_writereg(LCD_REG_83,  0x013f); /* Vertical GRAM End Address */
      stm3240g_writereg(LCD_REG_96,  0xa700); /* Gate Scan Line */
      stm3240g_writereg(LCD_REG_97,  0x0001); /* NDL, VLE, REV */
      stm3240g_writereg(LCD_REG_106, 0x0000); /* set scrolling line */

      /* Partial Display Control */

      stm3240g_writereg(LCD_REG_128, 0x0000);
      stm3240g_writereg(LCD_REG_129, 0x0000);
      stm3240g_writereg(LCD_REG_130, 0x0000);
      stm3240g_writereg(LCD_REG_131, 0x0000);
      stm3240g_writereg(LCD_REG_132, 0x0000);
      stm3240g_writereg(LCD_REG_133, 0x0000);

      /* Panel Control */

      stm3240g_writereg(LCD_REG_144, 0x0010); 
      stm3240g_writereg(LCD_REG_146, 0x0000);
      stm3240g_writereg(LCD_REG_147, 0x0003);
      stm3240g_writereg(LCD_REG_149, 0x0110);
      stm3240g_writereg(LCD_REG_151, 0x0000);
      stm3240g_writereg(LCD_REG_152, 0x0000);
 
      /* Set GRAM write direction and BGR=1
       * I/D=01 (Horizontal : increment, Vertical : decrement)
       * AM=1 (address is updated in vertical writing direction)
       */

      stm3240g_writereg(LCD_REG_3, 0x1018);
      stm3240g_writereg(LCD_REG_7, 0);      /* Display OFF */
    }
  else
#endif

  /* Check if the ID is for the almost compatible R61580 */

#if !defined(CONFIG_STM32_R61580_DISABLE)
  if (id == R61580_ID)
    {
      /* Set the LCD type for the R61580 */

      g_lcddev.type = LCD_TYPE_R61580;
      lcddbg("LCD type: %d\n", g_lcddev.type);

      /* Start Initial Sequence */

      stm3240g_writereg(LCD_REG_0,   0x0000);
      stm3240g_writereg(LCD_REG_0,   0x0000);
      up_mdelay(100);
      stm3240g_writereg(LCD_REG_0,   0x0000);
      stm3240g_writereg(LCD_REG_0,   0x0000);
      stm3240g_writereg(LCD_REG_0,   0x0000);
      stm3240g_writereg(LCD_REG_0,   0x0000);
      stm3240g_writereg(LCD_REG_164, 0x0001);
      up_mdelay(100);
      stm3240g_writereg(LCD_REG_96,  0xa700);
      stm3240g_writereg(LCD_REG_8,   0x0808);

      /* Gamma Setting */

      stm3240g_writereg(LCD_REG_48,  0x0203);
      stm3240g_writereg(LCD_REG_49,  0x080f);
      stm3240g_writereg(LCD_REG_50,  0x0401);
      stm3240g_writereg(LCD_REG_51,  0x050b);
      stm3240g_writereg(LCD_REG_52,  0x3330);
      stm3240g_writereg(LCD_REG_53,  0x0b05);
      stm3240g_writereg(LCD_REG_54,  0x0005);
      stm3240g_writereg(LCD_REG_55,  0x0f08);
      stm3240g_writereg(LCD_REG_56,  0x0302);
      stm3240g_writereg(LCD_REG_57,  0x3033);

      /* Power Setting */

      stm3240g_writereg(LCD_REG_144, 0x0018); /* 80Hz */
      stm3240g_writereg(LCD_REG_16,  0x0530); /* BT, AP */
      stm3240g_writereg(LCD_REG_17,  0x0237); /* DC1,DC0,VC */
      stm3240g_writereg(LCD_REG_18,  0x01bf);
      stm3240g_writereg(LCD_REG_19,  0x1000); /* VCOM */
      up_mdelay(200);

      stm3240g_writereg(LCD_REG_1,   0x0100); /* Set SS bit */
      stm3240g_writereg(LCD_REG_2,   0x0200);
      stm3240g_writereg(LCD_REG_3,   0x1030); /* Set GRAM write direction and BGR=1. */
      stm3240g_writereg(LCD_REG_9,   0x0001);
      stm3240g_writereg(LCD_REG_10,  0x0008);
      stm3240g_writereg(LCD_REG_12,  0x0000); /* RGB 18-bit System interface setting */
      stm3240g_writereg(LCD_REG_13,  0xd000);
      stm3240g_writereg(LCD_REG_14,  0x0030);
      stm3240g_writereg(LCD_REG_15,  0x0000); /* RGB interface polarity, no impact */
      stm3240g_writereg(LCD_REG_32,  0x0000); /* H Start */
      stm3240g_writereg(LCD_REG_33,  0x0000); /* V Start */
      stm3240g_writereg(LCD_REG_41,  0x002e);
      stm3240g_writereg(LCD_REG_80,  0x0000); /* Horizontal GRAM Start Address */
      stm3240g_writereg(LCD_REG_81,  0x00ef); /* Horizontal GRAM End Address */
      stm3240g_writereg(LCD_REG_82,  0x0000); /* Vertical GRAM Start Address */
      stm3240g_writereg(LCD_REG_83,  0x013f); /* Vertical GRAM End Address */
      stm3240g_writereg(LCD_REG_97,  0x0001); /* NDL, VLE, REV */
      stm3240g_writereg(LCD_REG_106, 0x0000); /* set scrolling line */
      stm3240g_writereg(LCD_REG_128, 0x0000);
      stm3240g_writereg(LCD_REG_129, 0x0000);
      stm3240g_writereg(LCD_REG_130, 0x005f);
      stm3240g_writereg(LCD_REG_147, 0x0701);

      stm3240g_writereg(LCD_REG_7,   0x0000); /* Display OFF */
    }
  else
#endif
    {
#ifndef CONFIG_STM32_AM240320_DISABLE
      g_lcddev.type = LCD_TYPE_AM240320;
      lcddbg("LCD type: %d\n", g_lcddev.type);

      /* Start Initial Sequence */

      stm3240g_writereg(LCD_REG_229, 0x8000); /* Set the internal vcore voltage */
      stm3240g_writereg(LCD_REG_0,   0x0001); /* Start internal OSC. */
      stm3240g_writereg(LCD_REG_1,   0x0100); /* Set SS and SM bit */
      stm3240g_writereg(LCD_REG_2,   0x0700); /* Set 1 line inversion */
      stm3240g_writereg(LCD_REG_3,   0x1030); /* Set GRAM write direction and BGR=1. */
      stm3240g_writereg(LCD_REG_4,   0x0000); /* Resize register */
      stm3240g_writereg(LCD_REG_8,   0x0202); /* Set the back porch and front porch */
      stm3240g_writereg(LCD_REG_9,   0x0000); /* Set non-display area refresh cycle ISC[3:0] */
      stm3240g_writereg(LCD_REG_10,  0x0000); /* FMARK function */
      stm3240g_writereg(LCD_REG_12,  0x0000); /* RGB interface setting */
      stm3240g_writereg(LCD_REG_13,  0x0000); /* Frame marker Position */
      stm3240g_writereg(LCD_REG_15,  0x0000); /* RGB interface polarity */

