PX4/PX4-Autopilot/nuttx/configs/stm3240g-eval/src/up_lcd.c
      /* Power On sequence */

      stm3240g_writereg(LCD_REG_16,  0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
      stm3240g_writereg(LCD_REG_18,  0x0000); /* VREG1OUT voltage */
      stm3240g_writereg(LCD_REG_19,  0x0000); /* VDV[4:0] for VCOM amplitude */
      up_mdelay(200);                         /* Dis-charge capacitor power voltage (200ms) */

      stm3240g_writereg(LCD_REG_16,  0x17b0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
      stm3240g_writereg(LCD_REG_17,  0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_18,  0x0139); /* VREG1OUT voltage */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_19,  0x1d00); /* VDV[4:0] for VCOM amplitude */
      stm3240g_writereg(LCD_REG_41,  0x0013); /* VCM[4:0] for VCOMH */
      up_mdelay(50);

      stm3240g_writereg(LCD_REG_32,  0x0000); /* GRAM horizontal Address */
      stm3240g_writereg(LCD_REG_33,  0x0000); /* GRAM Vertical Address */

      /* Adjust the Gamma Curve */

      stm3240g_writereg(LCD_REG_48,  0x0006);
      stm3240g_writereg(LCD_REG_49,  0x0101);
      stm3240g_writereg(LCD_REG_50,  0x0003);
      stm3240g_writereg(LCD_REG_53,  0x0106);
      stm3240g_writereg(LCD_REG_54,  0x0b02);
      stm3240g_writereg(LCD_REG_55,  0x0302);
      stm3240g_writereg(LCD_REG_56,  0x0707);
      stm3240g_writereg(LCD_REG_57,  0x0007);
      stm3240g_writereg(LCD_REG_60,  0x0600);
      stm3240g_writereg(LCD_REG_61,  0x020b);
  
      /* Set GRAM area */

      stm3240g_writereg(LCD_REG_80,  0x0000); /* Horizontal GRAM Start Address */
      stm3240g_writereg(LCD_REG_81,  0x00ef); /* Horizontal GRAM End Address */
      stm3240g_writereg(LCD_REG_82,  0x0000); /* Vertical GRAM Start Address */
      stm3240g_writereg(LCD_REG_83,  0x013f); /* Vertical GRAM End Address */
      stm3240g_writereg(LCD_REG_96,  0x2700); /* Gate Scan Line */
      stm3240g_writereg(LCD_REG_97,  0x0001); /* NDL,VLE, REV */
      stm3240g_writereg(LCD_REG_106, 0x0000); /* Set scrolling line */

      /* Partial Display Control */

      stm3240g_writereg(LCD_REG_128, 0x0000);
      stm3240g_writereg(LCD_REG_129, 0x0000);
      stm3240g_writereg(LCD_REG_130, 0x0000);
      stm3240g_writereg(LCD_REG_131, 0x0000);
      stm3240g_writereg(LCD_REG_132, 0x0000);
      stm3240g_writereg(LCD_REG_133, 0x0000);

      /* Panel Control */

      stm3240g_writereg(LCD_REG_144, 0x0010);
      stm3240g_writereg(LCD_REG_146, 0x0000);
      stm3240g_writereg(LCD_REG_147, 0x0003);
      stm3240g_writereg(LCD_REG_149, 0x0110);
      stm3240g_writereg(LCD_REG_151, 0x0000);
      stm3240g_writereg(LCD_REG_152, 0x0000);

      /* Set GRAM write direction and BGR = 1
       *
       * I/D=01 (Horizontal : increment, Vertical : decrement)
       * AM=1 (address is updated in vertical writing direction)
       */

      stm3240g_writereg(LCD_REG_3, 0x1018);
      stm3240g_writereg(LCD_REG_7, 0);       /* Display off */
#else
      lcddbg("Unsupported LCD type\n");
#endif
  }
}

/**************************************************************************************
 * Name:  stm3240g_backlight
 *
 * Description:
 *   The LCD backlight is driven from PA8 which must be configured as TIM1
 *   CH1.  TIM1 must then be configured to output a clock on PA8; the duty
 *   of the clock determineds the backlight level.
 *
 **************************************************************************************/

#ifdef CONFIG_LCD_BACKLIGHT
static void stm3240g_backlight(void)
{
#ifdef CONFIG_LCD_PWM
  uint32_t prescaler;
  uint32_t reload;
  uint32_t timclk;
  uint16_t bdtr;
  uint16_t ccmr;
  uint16_t ccer;
  uint16_t cr2;

  /* Calculate the TIM1 prescaler value */

  prescaler = (STM32_PCLK2_FREQUENCY / CONFIG_LCD_PWMFREQUENCY + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  /* Calculate the TIM1 reload value */

  timclk = STM32_PCLK2_FREQUENCY / prescaler;
  reload = timclk / CONFIG_LCD_PWMFREQUENCY;

  if (reload < 1)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }
  
  g_lcddev.reload = reload;
  
  /* Configure PA8 as TIM1 CH1 output */

  stm32_configgpio(GPIO_TIM1_CH1OUT);

  /* Enabled timer 1 clocking */

  modifyreg32(STM32_RCC_APB2ENR, 0, RCC_APB2ENR_TIM1EN);

  /* Reset timer 1 */

  modifyreg32(STM32_RCC_APB2RSTR, 0, RCC_APB2RSTR_TIM1RST);
  modifyreg32(STM32_RCC_APB2RSTR, RCC_APB2RSTR_TIM1RST, 0);

  /* Reset the Counter Mode and set the clock division */

  putreg16(0, STM32_TIM1_CR1);

  /* Set the Autoreload value */

  putreg16(reload-1, STM32_TIM1_ARR);

  /* Set the Prescaler value */

  putreg16(prescaler-1, STM32_TIM1_PSC);

  /* Generate an update event to reload the Prescaler value immediatly */

  putreg16(ATIM_EGR_UG, STM32_TIM1_EGR);

  /* Reset the Repetition Counter value */

  putreg16(0, STM32_TIM1_RCR);

  /* Set the main output enable (MOE) bit and clear the OSSI and OSSR
   * bits in the BDTR register.
   */

  bdtr  = getreg16(STM32_TIM1_BDTR);
  bdtr &= ~(ATIM_BDTR_OSSI | ATIM_BDTR_OSSR);
  bdtr |= ATIM_BDTR_MOE;
  putreg16(bdtr, STM32_TIM1_BDTR);

  /* Disable the Channel 1 */

  ccer  = getreg16(STM32_TIM1_CCER);
  ccer &= ~ATIM_CCER_CC1E;
  putreg16(ccer, STM32_TIM1_CCER);

  /* Get the TIM1 CR2 register value */

  cr2  = getreg16(STM32_TIM1_CR2);

  /* Select the Output Compare Mode Bits */
  
  ccmr  = getreg16(STM32_TIM1_CCMR1);
  ccmr &= ATIM_CCMR1_OC1M_MASK;
  ccmr |= (ATIM_CCMR_MODE_PWM1 << ATIM_CCMR1_OC1M_SHIFT);
  ccmr |= (ATIM_CCMR_CCS_CCOUT << ATIM_CCMR1_CC1S_SHIFT);

  /* Set the power to the minimum value */

  g_lcddev.power = 0;
  putreg16(0, STM32_TIM1_CCR1);

  /* Select the output polarity level == LOW and enable */

  ccer |= (ATIM_CCER_CC1E );

  /* Reset the Output N Polarity level */

  ccer &= ~(ATIM_CCER_CC1NP|ATIM_CCER_CC1NE);

  /* Reset the Ouput Compare and Output Compare N IDLE State */

  cr2 &= ~(ATIM_CR2_OIS1|ATIM_CR2_OIS1N);

  /* Write the timer configuration */

  putreg16(cr2, STM32_TIM1_CR2);
  putreg16(ccmr, STM32_TIM1_CCMR1);
  putreg16(ccer, STM32_TIM1_CCER);

  /* Set the auto preload enable bit */

  modifyreg16(STM32_TIM1_CR1, 0, ATIM_CR1_ARPE);

